In [1]:
import pandas as pd

## Creating DataFrame from Dict

In [2]:
df = pd.DataFrame({"Grades":[85,72,92,100,88],
            "Students":["Matt", "Tom", "Jerry", "Lucy", "Shannon"],
                 "ClassPeriod":[1,1,2,2,2]})

In [3]:
df

   Grades Students  ClassPeriod
0      85     Matt            1
1      72      Tom            1
2      92    Jerry            2
3     100     Lucy            2
4      88  Shannon            2